08_RTD_openFoam/tundish_OF_V13/tundishScalar2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    
    walls
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    defaultFaces
    {
        type            empty;
    }

    obstacle
    {
        type            zeroGradient;
    }

    inlet
    {
        type            uniformFixedValue;

        uniformValue
        {
            type        constant;
            value       1.0;
        }
    }
    
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
