08_RTD_openFoam/tundish_OF_V13/tundishScalar2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1120
(
(0.00014972 0 -0.000173258)
(0.000520142 0 -0.000395736)
(0.00140992 0 -0.000681137)
(0.00281311 0 -0.00098988)
(0.00470553 0 -0.00125122)
(0.00694942 0 -0.00139737)
(0.00931661 0 -0.00139519)
(0.0115622 0 -0.00125554)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.1);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 2((0.028412 0 -0.0847265) (-0.018272 0 -0.0884594));
    }
}


// ************************************************************************* //
