08_RTD_openFoam/tundish_OF_V13/tundishScalar2D/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
2154
(
1.44891e-06
-1.44891e-06
4.77406e-06
-3.32515e-06
1.04616e-05
-5.68749e-06
1.86896e-05
-8.22806e-06
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform -0.0005;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0.000488906 0.000511094);
    }
}


// ************************************************************************* //
