08_RTD_openFoam/tundish_OF_V13/tundishScalar2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        norm            default;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

/*
SIMPLE
{
    nNonOrthogonalCorrectors 0;

    relaxationFactors
    {
        field
        {
            T       0.5;
        }
        equation
        {
            T       0.5;
        }
    }

}
*/

// ************************************************************************* //
